Tekla.Structures.ModelInternal.dotEnumerator_t


Tekla.Structures.ModelInternal.dotEnumerator_t.MoreObjectsLeft


Tekla.Structures.ModelInternal.dotEnumerator_t.nObjects


Tekla.Structures.ModelInternal.dotEnumerator_t.Filter
Enumerator type

Tekla.Structures.ModelInternal.dotEnumerator_t.SubFilter
Enumerator subtype

Tekla.Structures.ModelInternal.dotEnumerator_t.nObjectToStart


Tekla.Structures.ModelInternal.dotEnumerator_t.aObjects


Tekla.Structures.ModelInternal.dotEnumerator_t.aObjectTypes


Tekla.Structures.ModelInternal.dotEnumerator_t.AdditionalId
For example for getting children info

Tekla.Structures.ModelInternal.dotEnumerator_t.aFilterName
Name of the select filter to apply

Tekla.Structures.ModelInternal.dotEnumerator_t.MinPoint
MinPoint of bounding box to apply.

Tekla.Structures.ModelInternal.dotEnumerator_t.MaxPoint
MaxPoint of bounding box to apply.

Tekla.Structures.ModelInternal.dotEnumerator_t.ViewId
The view identifier to use when getting objects by bounding box and view.

Tekla.Structures.ModelInternal.dotEnumerator_t.ModificationStamp
Guid, or 2 integers encoded as Guid

Tekla.Structures.ModelInternal.dotEnumerator_t.ClientId


Tekla.Structures.ModelInternal.dotEnumerator_t.ReturnAlsoIfObjectIsCreatedAndDeletedAfterEvent
The return object as deleted if object is both created and deleted after event.